---
kind: method
id: M:Autodesk.Revit.DB.ViewSet.Erase(Autodesk.Revit.DB.View)
source: html/542e7608-1e2c-ff7d-c045-26db675b9c27.htm
---
# Autodesk.Revit.DB.ViewSet.Erase Method

Removes a specified view from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	View item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.View`) - The view to be erased.

## Returns
The number of views that were erased from the set.